Repository: AlphaCoreSolutions/edupass_frontend
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome 👋
ar: مرحبًا بك 👋

# noStudents
source: No linked students found
ar: لا يوجد أبناء مرتبطين بالحساب

source: Add Student
ar: إضافة طالب

source: Grade
ar: الصف

source: ID Number
ar: رقم الهوية

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Latest Request
ar: آخر طلب

# cancelNotice
source: You can cancel the request before approval
ar: يمكنك إلغاء الطلب قبل الموافقة

source: Cancel
ar: إلغاء

# requestCanceled
source: Request cancelled
ar: تم إلغاء الطلب

# generatePdf
source: Generate Dismissal Card
ar: توليد بطاقة الانصراف

source: Request Dismissal
ar: طلب انصراف

source: Request Early Leave
ar: طلب استئذان

source: Request History:
ar: سجل الطلبات:

source: Pending
ar: قيد الانتظار

source: Approved
ar: موافقة

source: Rejected
ar: مرفوض

# completed
source: Dismissed
ar: تم الانصراف

source: Dismissal
ar: انصراف

source: Early Leave
ar: استئذان

source: Children
ar: أبنائي

source: Requests
ar: الطلبات

source: Account
ar: الحساب

source: My Requests
ar: طلباتي

source: No requests yet
ar: لا توجد طلبات حتى الآن

source: Settings
ar: الإعدادات

source: Username
ar: اسم المستخدم

# parentExperimental
source: Parent (Demo)
ar: ولي الأمر (تجريبي)

# clearRequests
source: Clear All Requests
ar: مسح كل الطلبات

source: Requests cleared
ar: تم مسح الطلبات

source: Logout
ar: تسجيل الخروج

source: Admin Panel
ar: لوحة الإدارة

# studentName
source: Student
ar: الطالبة

source: Request Type
ar: نوع الطلب

# requestStatus
source: Status
ar: الحالة

source: Reason
ar: السبب

# typeDismissal
source: Dismissal
ar: انصراف

# typeEarlyLeave
source: Early Leave
ar: استئذان

# statusPending
source: Pending
ar: قيد الانتظار

# statusApproved
source: Approved
ar: تمت الموافقة

# statusRejected
source: Rejected
ar: مرفوض

# statusCompleted
source: Completed
ar: تم الانصراف

# gateTitle
source: School Gate
ar: بوابة المدرسة

# gateNoStudents
source: No students ready to exit
ar: لا يوجد طالبات جاهزات للخروج

# gateExitSuccess
source: {name} has exited through the gate ✅
ar: {name} خرجت من البوابة ✅

# gateExitError
source: An error occurred while updating request status
ar: حدث خطأ أثناء تحديث حالة الطلب

# exitDone
source: Mark Exit
ar: تم الخروج

# scanQR
source: Scan Parent QR
ar: مسح QR ولي الأمر

source: Unknown
ar: غير معروف

# qrInvalid
source: Invalid QR code
ar: الرمز غير صالح

# qrNotFound
source: Request not found
ar: الطلب غير موجود

# qrNotApproved
source: Request is not approved
ar: الطلب ليس في حالة موافقة

# qrStudentNotFound
source: Student not found
ar: الطالبة غير موجودة

# qrConfirmExit
source: Confirm Exit
ar: تأكيد الخروج

# qrConfirmExitMessage
source: Confirm that {name} has exited the gate?
ar: تأكيد خروج {name} من البوابة؟

# qrExitSuccess
source: {name} has exited the gate ✅
ar: {name} خرجت من البوابة ✅

source: Confirm
ar: تأكيد

# supervisorTitle
source: Supervisor Dashboard
ar: واجهة المشرفة

# supervisorNoRequests
source: No active requests
ar: لا توجد طلبات نشطة

# studentGrade
source: Grade
ar: الصف

# studentId
source: ID Number
ar: الهوية

# studentGender
source: Gender
ar: الجنس

# requestReason
source: Reason
ar: السبب

# actionApprove
source: Approve
ar: موافقة

# actionReject
source: Reject
ar: رفض

# actionComplete
source: Complete
ar: تم الخروج

# genderMale
source: Male
ar: ذكر

# genderFemale
source: Female
ar: أنثى

# smartDisplayTitle
source: 📢 Smart Call
ar: 📢 النداء الذكي

# smartDisplayEmpty
source: No students approved for dismissal at the moment
ar: لا توجد طالبات تمت الموافقة على خروجهن حاليًا

source: Admin Dashboard
ar: لوحة الإدارة

source: Total Students
ar: عدد الطلاب

source: Total Requests
ar: الطلبات الكلية

source: Pending Requests
ar: طلبات معلقة

source: Request Log
ar: سجل الطلبات

source: Exit
ar: خروج

# statsChart
source: Statistics Chart
ar: الرسم البياني للإحصائيات

source: Export Data
ar: تصدير البيانات

# exportSuccess
source: Data exported successfully
ar: تم تصدير البيانات بنجاح

source: User Management
ar: إدارة المستخدمين

source: Add User
ar: إضافة مستخدم

source: Add New User
ar: إضافة مستخدم جديد

source: Name
ar: الاسم

source: Role
ar: الدور

source: Add
ar: إضافة

source: Delete
ar: حذف

source: Change Role
ar: تغيير الدور

# noUsers
source: No users found
ar: لا يوجد مستخدمون

source: Filter by role
ar: تصفية حسب الدور

source: All
ar: الكل

# userAdded
source: User added successfully
ar: تمت إضافة المستخدم

# userDeleted
source: {name} has been deleted
ar: تم حذف {name}

source: Edit User
ar: تعديل المستخدم

source: Search...
ar: بحث...

# roleParent
source: Parent
ar: ولي أمر

# roleSupervisor
source: Supervisor
ar: مشرفة

# roleAdmin
source: Admin
ar: مديرة

# userUpdated
source: User updated successfully {name}
ar: تم تحديث المستخدم بنجاح {name}

# loginSelectRole
source: Select your role to login
ar: اختر دورك لتسجيل الدخول

# roleGate
source: Gate
ar: بوابة

# schoolAppTitle
source: School Dismissal System
ar: نظام الانصراف المدرسي

# loadingDots
source: Loading...
ar: جاري التحميل...

source: National ID
ar: رقم الهوية الوطنية

source: Select Photo
ar: اختيار صورة

# requiredField
source: Required
ar: مطلوب

# studentAdded
source: Student added successfully
ar: تمت إضافة الطالب

source: Language
ar: اللغة

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

# dismissalCardTitle
source: Dismissal Card
ar: بطاقة الانصراف

source: Photo
ar: الصورة

source: Requested By
ar: مقدم الطلب

source: Request Time
ar: وقت تقديم الطلب

source: Current Status
ar: الحالة الحالية

source: Attachment
ar: المرفق

# qrCodeLabel
source: Pickup QR Code
ar: رمز الاستلام (QR)

# pdfDisclaimerLine1
source: This document is auto-generated and does not require a signature.
ar: هذا المستند يولد آليًا ولا يحتاج إلى توقيع.

# pdfDisclaimerLine2
source: Please present this document at the gate during pickup.
ar: يرجى إبراز هذا المستند عند الخروج من البوابة.

# errorTryAgain
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.

source: Are you sure?
ar: هل أنت متأكد؟

# lookupsNotReady
source: Lookup data is not ready yet
ar: لم يتم تحميل بيانات القائمة بعد

# alreadyHasPending
source: Student already has a pending request
ar: للطالبة طلب قيد الانتظار بالفعل

# selectReason
source: Please select a reason
ar: يرجى اختيار سبب الاستئذان

source: Request sent
ar: تم إرسال الطلب

source: Note (optional)
ar: ملاحظة (اختياري)

source: Send
ar: إرسال

source: Select user
ar: اختر المستخدم

source: Refresh
ar: تحديث

source: Log in
ar: تسجيل الدخول

source: Continue without account
ar: متابعة بدون حساب

# requestFailed
source: Request Failed To Send
ar: فشل إرسال الطلب

source: Sending...
ar: جارٍ الإرسال…

# filtersTitle
source: Filters
ar: الفلاتر

source: Select student
ar: اختر الطالب

source: Status
ar: الحالة

# resetFilters
source: Reset
ar: إعادة تعيين

# adminShortcutsBusesTitle
source: Official Buses
ar: الحافلات الرسمية

# adminShortcutsBusesSubtitle
source: Manage buses, schedules and fees
ar: إدارة الحافلات، الجداول والرسوم

# adminShortcutsBusRequestsTitle
source: Bus Join Requests
ar: طلبات الانضمام للحافلات

# adminShortcutsBusRequestsSubtitle
source: Review, approve/reject and activate paid
ar: مراجعة، موافقة/رفض، وتفعيل مدفوع

# busesStatsTitle
source: Bus Analytics
ar: إحصائيات الحافلات

source: Neighborhood
ar: الحي

source: Supervisor ID
ar: رقم المشرف

# downloadCsv
source: Export CSV
ar: تصدير CSV

source: Export failed
ar: فشل التصدير

source: Permission denied
ar: تم رفض الإذن

# currencySarShort
source: SAR
ar: ر.س

# monthlyFeeShort
source: SAR/month
ar: ر.س/شهر

# busGoTime
source: Go
ar: ذهاب

# busReturnTime
source: Return
ar: عودة

# busesCountFiltered
source: Buses (filtered)
ar: عدد الحافلات (مطبق الفلاتر)

# awaitingPaymentCount
source: Awaiting payment
ar: بانتظار الدفع

# paidActiveCount
source: Active (paid)
ar: نشطة (مدفوعة)

source: Estimated monthly revenue
ar: الإيراد الشهري التقديري

# noBusChartData
source: No bus data to chart
ar: لا توجد بيانات حافلات لعرض الرسوم البيانية

source: Active subscribers per bus
ar: المشتركين النشطين لكل حافلة

# awaitingPerBus
source: Awaiting payment per bus
ar: طلبات بانتظار الدفع لكل حافلة

# activeShort
source: Active
ar: نشط

# awaitingShort
source: Awaiting
ar: بانتظار

source: Quick details
ar: تفاصيل سريعة

source: Active subscribers
ar: مشتركين نشطين

source: Awaiting payment
ar: بانتظار الدفع

source: No items
ar: لا يوجد

source: Parent
ar: ولي الأمر

# reference
source: Ref
ar: المرجع

# exportBusCsv
source: Export bus enrollments CSV
ar: تصدير CSV لطلبات الحافلات

# busRequestsTitle
source: Bus Join Requests
ar: طلبات الانضمام للحافلات

# busStatusPending
source: Pending
ar: قيد المراجعة

# busStatusApprovedAwaitingPayment
source: Approved, awaiting payment
ar: موافق عليه بانتظار الدفع

# busStatusPaid
source: Active (paid)
ar: مفعل (مدفوع)

# busStatusRejected
source: Rejected
ar: مرفوض

# busStatusCancelled
source: Cancelled
ar: ملغي

# searchStudentOrBus
source: Search by student / bus
ar: بحث باسم الطالب / الحافلة

source: Clear
ar: مسح

source: No results
ar: لا توجد نتائج

source: Request
ar: طلب

source: Payment ref
ar: مرجع الدفع

# paymentRefHint
source: e.g., TXN-12345
ar: مثال: TXN-12345

source: Approve
ar: موافقة

source: Reject
ar: رفض

# activatePaidManually
source: Activate manually (paid)
ar: تفعيل يدوي (مدفوع)

source: Reject after approval
ar: رفض بعد الموافقة

source: No action
ar: لا يوجد إجراء

# busManageTitle
source: Official Bus Management
ar: إدارة الحافلات الرسمية

source: Added buses
ar: الحافلات المضافة

# noBuses
source: No buses added yet
ar: لا توجد حافلات مضافة بعد

# addBusHint
source: Use the form below to add a new bus
ar: استخدم النموذج بالأسفل لإضافة حافلة جديدة

source: Edit
ar: تعديل

source: Add bus
ar: إضافة حافلة

source: Edit bus
ar: تعديل حافلة

source: Edit mode
ar: وضع التعديل

source: Save changes
ar: حفظ التعديلات

source: Bus name
ar: اسم الحافلة

source: Route description
ar: وصف المسار

# goTimeLabel
source: Go
ar: الذهاب

# returnTimeLabel
source: Return
ar: العودة

source: Monthly fee
ar: الرسوم الشهرية

source: Bus supervisor ID
ar: رقم مشرف الحافلة

source: Required
ar: مطلوب

source: Invalid value
ar: قيمة غير صالحة

source: Invalid number
ar: رقم غير صالح

# invalidTimeFormat
source: Invalid format, e.g. 06:45
ar: صيغة غير صحيحة، مثال 06:45

source: Invalid time
ar: وقت غير صالح

# selectOperatingDays
source: Please select operating days
ar: يرجى اختيار أيام التشغيل

# addedSuccess
source: Added successfully
ar: تمت الإضافة

# savedSuccess
source: Saved successfully
ar: تم الحفظ

source: Clear form
ar: تفريغ النموذج

source: Pick time
ar: اختر الوقت

# deleteBusTitle
source: Delete bus
ar: حذف الحافلة

# deleteBusConfirm
source: Are you sure you want to delete "{name}"?
ar: هل أنت متأكد من حذف "{name}"؟

# deleteAction
source: Delete
ar: حذف

# loadedForEdit
source: Bus data loaded for editing
ar: تم تحميل بيانات الحافلة للتعديل

# weekdaySun
source: Sunday
ar: الأحد

# weekdayMon
source: Monday
ar: الاثنين

# weekdayTue
source: Tuesday
ar: الثلاثاء

# weekdayWed
source: Wednesday
ar: الأربعاء

# weekdayThu
source: Thursday
ar: الخميس

# weekdayFri
source: Friday
ar: الجمعة

# weekdaySat
source: Saturday
ar: السبت

source: Manual Entry
ar: إدخال يدوي

# parentHomeTitle
source: My Children
ar: أبنائي

source: Current Transport
ar: وسيلة النقل الحالية

# noBusAssigned
source: No bus assigned yet
ar: لا توجد حافلة مخصصة بعد

# joinBus
source: Join a Bus
ar: الانضمام إلى حافلة

source: Join
ar: انضمام

# parentBusJoinTitle
source: School Buses
ar: حافلات المدرسة

# searchHint
source: Search for a bus…
ar: ابحث عن حافلة…

source: Reset
ar: إعادة تعيين

# busStatusAwaitPayment
source: Awaiting payment
ar: بانتظار الدفع

# busStatusActive
source: Active
ar: نشط

# payAndActivate
source: Pay & Activate
ar: دفع وتفعيل

# refreshShort
source: Refresh
ar: تحديث

# parentBusesTitle
source: School Buses
ar: الحافلات المدرسية

# parentBusesSubtitle
source: Browse buses, request to join, manage payments
ar: تصفّح الحافلات، اطلب الانضمام، وأدِر المدفوعات

# authorizedPeopleTitle
source: Authorized Pickups
ar: الأشخاص المصرّح لهم

# authorizedPeopleSubtitle
source: Add and manage trusted people to pick up your child
ar: أضف وأدر الأشخاص الموثوقين لاستلام طفلك

source: Active
ar: نشط

source: Manage
ar: إدارة

source: Authorized people: {count}
ar: الأشخاص المصرّح لهم: {count}

# requestJoinBus
source: Request to Join
ar: طلب الانضمام

source: My Bus Requests
ar: طلبات الحافلات الخاصة بي

# paymentActivated
source: Payment completed. Enrollment activated.
ar: تم الدفع وتفعيل الاشتراك.

# statusAwaitingPayment
source: Awaiting Payment
ar: بانتظار الدفع

# statusActive
source: Active
ar: نشط

# statusCancelled
source: Cancelled
ar: ملغي

source: Inactive
ar: غير نشط

source: No active bus
ar: لا توجد حافلة نشطة

source: Full Name
ar: الاسم الكامل

source: Phone
ar: الهاتف

source: Add Authorized Person
ar: إضافة شخص مصرح

# deleteConfirmName
source: Are you sure you want to delete "{name}"?
ar: هل تريد حذف {name}؟

# deletedSuccess
source: Deleted successfully
ar: تم الحذف
